<center><h1> OBJECTIVE

<h3><i>1.  Merging the 2 CSV Files in the "Graduate_split" Folder into a Single CSV File. <br>
<br>
2.  Merging the 10 CSV Files in the "Group_split" Folder into a Single CSV File.

In [22]:
### import required Libraries
import pandas as pd
import os

<b><h3><i>1.  Merging the 2 CSV Files in the "Graduate_split" Folder into a Single CSV File.

In [23]:
## viewing the pattern of the Dataset
df = pd.read_csv('./Graduate_split//Graduate_1.csv')
df.head()

,Name,Country,Sex,Age,University,Department,CGPA
0,Renate Brimming,Argentina,M,40,Instituto Universitario Nacional del Arte,Engineering,3.80
1,Hayden Bowden,France,F,34,Ecole Nationale de l'Aviation Civile,Legal,2.96
2,Yale Edgeler,Malaysia,M,20,Islamic College for Sciences and Technologies,Training,2.06
3,Ericka Herity,Croatia,M,44,University of Rijeka,Accounting,2.62
4,Dominic Windrass,Philippines,F,39,Silliman University,Legal,1.60

### <i>Graduate_1 Dataset Rows and Columns

In [24]:
df.shape

(5000, 7)

### <i>Data Processing

In [25]:
files = [file for file in os.listdir('./Graduate_split/')]
graduates = pd.DataFrame()
for file in files:
    df = pd.read_csv('./Graduate_split/'+ file)
    graduates= pd.concat([graduates,df])
## the first 5 rows of the Merged Data
graduates.head()

,Name,Country,Sex,Age,University,Department,CGPA
0,Renate Brimming,Argentina,M,40,Instituto Universitario Nacional del Arte,Engineering,3.80
1,Hayden Bowden,France,F,34,Ecole Nationale de l'Aviation Civile,Legal,2.96
2,Yale Edgeler,Malaysia,M,20,Islamic College for Sciences and Technologies,Training,2.06
3,Ericka Herity,Croatia,M,44,University of Rijeka,Accounting,2.62
4,Dominic Windrass,Philippines,F,39,Silliman University,Legal,1.60

### <i>The Merged Dataset Rows and Columns

In [26]:
graduates.shape

(10000, 7)

### <i>Converting the Merged_Graduate Dataframe to CSV file

In [34]:
graduates.to_csv('Merge_Graduate.csv', index= False)

### <b> <i>2.  Merging the 10 CSV Files in the "Group_split" Folder into a Single CSV File.

In [28]:
## viewing the pattern of the Dataset
df2 = pd.read_csv('./Group_split/Group_1.csv')
df2.head()

,Name,Country,Sex,Age,University,Department,CGPA
0,Jaquelin Pleasance,Indonesia,M,34,Universitas Pasundan,Engineering,1.89
1,Jocelyn Rothschild,Portugal,F,32,Instituto Superior de Ciências Empresariais e ...,Product Management,2.31
2,Stefan Durnford,Poland,M,22,Christian Theological Academy in Warszaw,Human Resources,2.58
3,Blinny Tyrwhitt,Canada,M,36,St. Mary's University,Engineering,2.13
4,Correy Matelaitis,New Zealand,F,21,Open Polytechnic,Business Development,3.90

### <i>Group_1 Dataset Rows and Columns

In [29]:
df2.shape

(1000, 7)

### <i>Data Processing

In [30]:
files = [file for file in os.listdir('./Group_split/')]
groups = pd.DataFrame()
for file in files:
    df2 = pd.read_csv('./Group_split/'+ file)
    groups= pd.concat([groups,df2])

## The first 10 rows of the Merged Data
groups.head(10)

,Name,Country,Sex,Age,University,Department,CGPA
0,Jaquelin Pleasance,Indonesia,M,34,Universitas Pasundan,Engineering,1.89
1,Jocelyn Rothschild,Portugal,F,32,Instituto Superior de Ciências Empresariais e ...,Product Management,2.31
2,Stefan Durnford,Poland,M,22,Christian Theological Academy in Warszaw,Human Resources,2.58
3,Blinny Tyrwhitt,Canada,M,36,St. Mary's University,Engineering,2.13
4,Correy Matelaitis,New Zealand,F,21,Open Polytechnic,Business Development,3.90
5,Claudina De Roeck,Sweden,F,44,Royal lnstitute of Technology,Product Management,2.84
6,Ashla Ollett,China,F,35,Henan Agriculture University,Human Resources,2.01
7,Agnella January 1st,Bosnia and Herzegovina,F,36,"Univerzitet u Mostaru ""Dzemal Bijedic""",Support,4.68
8,Addy Wareham,China,F,39,North China University of Technology,Legal,2.71
9,Jim Papaminas,Russia,M,31,Yugra State University,Human Resources,2.68

### <i>The Merged Dataset Rows and Columns

In [31]:
groups.shape

(10000, 7)

### <i>Converting the Merged_Group Dataframe to CSV file

In [33]:
groups.to_csv('Merge_Group.csv', index= False)